test/load-test-results/3-responsecompression/statistics/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 430,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 335.44883720930255,
    "medianResTime" : 293.5,
    "minResTime" : 130.0,
    "maxResTime" : 1285.0,
    "pct1ResTime" : 653.6000000000001,
    "pct2ResTime" : 844.5999999999999,
    "pct3ResTime" : 1155.32,
    "throughput" : 12.20238939811005,
    "receivedKBytesPerSec" : 121.9730414544255,
    "sentKBytesPerSec" : 1.608713446039899
  },
  "https://localhost:44313/Home/Statistics" : {
    "transaction" : "https://localhost:44313/Home/Statistics",
    "sampleCount" : 430,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 335.44883720930255,
    "medianResTime" : 293.5,
    "minResTime" : 130.0,
    "maxResTime" : 1285.0,
    "pct1ResTime" : 653.6000000000001,
    "pct2ResTime" : 844.5999999999999,
    "pct3ResTime" : 1155.32,
    "throughput" : 12.20238939811005,
    "receivedKBytesPerSec" : 121.9730414544255,
    "sentKBytesPerSec" : 1.608713446039899
  }
}