test/load-test-results/5-caching/listings-1/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1075,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.18604651162789,
    "medianResTime" : 19.0,
    "minResTime" : 15.0,
    "maxResTime" : 304.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 41.0,
    "pct3ResTime" : 61.0,
    "throughput" : 30.701128087962303,
    "receivedKBytesPerSec" : 2735.626361023847,
    "sentKBytesPerSec" : 3.837641010995288
  },
  "https://localhost:44313/Listings" : {
    "transaction" : "https://localhost:44313/Listings",
    "sampleCount" : 1075,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.18604651162789,
    "medianResTime" : 19.0,
    "minResTime" : 15.0,
    "maxResTime" : 304.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 41.0,
    "pct3ResTime" : 61.0,
    "throughput" : 30.701128087962303,
    "receivedKBytesPerSec" : 2735.626361023847,
    "sentKBytesPerSec" : 3.837641010995288
  }
}